[{"slug": "chatgpt-vs-bard-which-is-better-for-coding", "title": "ChatGPT Vs Bard: Which is better for coding?", "id": "clk33xd6t1c690bsmxrphpu8k", "createdAt": "14 Jul 2023", "description": "We test out which tool is best at code generation, problem solving, refactoring code, providing debugging assistance", "richText": {"html": "<p>For programmers, Generative AI offers tangible benefits. It helps with <a rel=\"noopener noreferrer\" target='_blank' title=\"https://www.pluralsight.com/blog/software-development/how-use-chatgpt-programming-coding\" href=\"https://www.pluralsight.com/blog/software-development/how-use-chatgpt-programming-coding\">writing and debugging code</a>, making our busy lives a bit easier as a result. But there are now competing tools like <a rel=\"noopener noreferrer\" target='_blank' title=\"https://www.pluralsight.com/blog/machine-learning/what-is-chatgpt-generative-ai\" href=\"https://www.pluralsight.com/blog/machine-learning/what-is-chatgpt-generative-ai\">ChatGPT</a> and <a rel=\"noopener noreferrer\" target='_blank' title=\"https://bard.google.com/\" href=\"https://bard.google.com/\">Bard</a>, which begs the question: which one is best for me to use?</p><p>We compare these tools against each other in the ultimate battle to see which is the most feature-rich tool right now for programming purposes.</p><img src=\"https://media.graphassets.com/4ciUvu3fTZKQ3BadT09T\" alt=\"ChatGPT-vs-Bard-c.png\" title=\"ChatGPT-vs-Bard-c.png\" width=\"1400\" height=\"689\" /><h2>ChatGPT and Bard: What’s the difference?</h2><p>The biggest difference between ChatGPT and Bard is the Large Language Models (LLMs) they are powered by. ChatGPT uses the Generative Pre-trained Transformer 4 (<a rel=\"noopener noreferrer\" target='_blank' title=\"https://www.pluralsight.com/blog/machine-learning/gpt-4-and-chatgpt-update\" href=\"https://www.pluralsight.com/blog/machine-learning/gpt-4-and-chatgpt-update\">GPT-4</a>), while Bard uses the Language Model for Dialogue Applications (<a rel=\"noopener noreferrer\" target='_blank' title=\"https://blog.google/technology/ai/lamda/\" href=\"https://blog.google/technology/ai/lamda/\">LaMBDA</a>). Also, ChatGPT is developed by OpenAI, while Bard was built by Google.</p><p>In terms of capabilities, both do very similar things. Programmers can use ChatGPT for:</p><ul><li><div><p><strong>Suggestions: </strong>Both models can suggest the correct syntax and parameters for functions and other code constructs.</p></div></li><li><div><p><strong>Completion: </strong>It can complete code that you have started writing.</p></div></li><li><div><p><strong>Debugging:</strong> It can help you identify errors and problems in your code.</p></div></li><li><div><p><strong>Explanation:</strong> It can explain the code that it generates, or code you input.</p></div></li></ul><p>Both models were trained on a massive dataset, including Common Crawl, Wikipedia, books, articles, documents, and content scraped from the internet. However, Bard is a little different in that it was trained on conversations and dialogues from the web, while ChatGPT was trained mostly on scraped general content.</p><p>Both products are still under development, Bard a bit more so than ChatGPT. But to really show how these differences actually matter in a practical sense, here’s how they work when tested against each other.</p><h2>Testing ChatGPT and Bard against each other</h2><p>We chose seven categories to test the chatbots against each other, based on what we felt were the most relevant: code generation, problem solving, refactoring code, debugging assistance, third-party plugins/UI extension, ease of use, and cost. Let&#39;s preface this by saying this is not a rigorous scientific comparison, but rather a handful of tests mixed with our hands-on experience to date.</p><h3>1. Code generation</h3><p>The bread and butter of what we want it for, right? For this, we fed in the following prompt: <em>&quot;Write a function in python that returns a list of 100 prime numbers.&quot; </em></p><h4>Bard&#39;s coding attempt</h4><pre><code>def get_prime_numbers(n):\n  &quot;&quot;&quot;Returns a list of prime numbers up to n.&quot;&quot;&quot;\n  primes = []\n  for i in range(2, n + 1):\n    is_prime = True\n    for j in range(2, i):\n      if i % j == 0:\n        is_prime = False\n        break\n    if is_prime:\n      primes.append(i)\n  return primes\n\n\ndef main():\n  &quot;&quot;&quot;Prints a list of 100 prime numbers.&quot;&quot;&quot;\n  primes = get_prime_numbers(100)\n  print(primes)\n\n\nif __name__ == &quot;__main__&quot;:\n  main()<a rel=\"noopener noreferrer\" target='_blank' title=\"https://www.pluralsight.com/blog/machine-learning/regenerative-auto-code-ai-gpt\" href=\"https://www.pluralsight.com/blog/machine-learning/regenerative-auto-code-ai-gpt\">AI-generated code in production with no human oversight</a></code></pre><p>Looks solid, but does it work? In our experience, chatbots can sometimes create code that <em>doesn&#39;t</em> run, even going as far as to invent functions! That&#39;s one reason having would be very bad. So let&#39;s test it out and see.</p>"}}, {"slug": "fbi-surveillance-fears-are-uniting-a-badly-broken-congress", "title": "FBI Surveillance Fears Are Uniting a Badly Broken Congress", "id": "clk34zf391dci0bsmate4gx8q", "createdAt": "14 Jul 2023", "description": "The FBI has collected sensitive data on millions of Americans without warrants, drawing intense scrutiny from Congress and turning the agency into a punching bag across the political divide.", "richText": {"html": "<p><strong>FEARS OVER THE</strong> death of privacy in the United States are turning some of Washington’s most pronounced enemies into the strangest of bedfellows. Lawmakers usually thought incapable of reconciling even the smallest of differences are finding rare common ground over a shared mistrust of the Federal Bureau of Investigation, and a mutual disdain for domestic spying.</p><p>At a committee hearing Wednesday, US Representative Zoe Lofgren of California called out the FBI&#39;s director, Christopher Wray, over a disclosure he’d reluctantly made in March: Not long ago, he said, the FBI had circumvented the need to obtain search warrants by buying commercial data that revealed the whereabouts of an unknown number of Americans. Buying this data, rather than compelling its disclosure, allowed the FBI to forgo asking a judge’s permission—a requirement as of 2018, thanks to the Supreme Court decision <em>Carpenter v. United States.</em></p><p>Disturbed by this revelation, Lofgren—a 14-term Democrat and leader of past efforts to curb government surveillance on US soil—used the hearing to take a deeper interest in Wray’s claim that the data was originally collected for advertising purposes. Wray showed resistance to revealing anything new, saying only that the deal was legal and that his staff would follow up with Lofgren; that way, he added, “I don’t leave something important out.”</p><p>With limited time, Lofgren moved on to other concerns. But as her time expired she ended with a warning: “We’ll be looking into those warrant requirements later.” Jim Jordan, the committee&#39;s Republican chair, chimed in as Lofrgen’s microphone went dead. “We sure will,” he said. “We sure will.”</p><p>Since last year&#39;s raid on ex-president Donald Trump’s Mar-a-Lago residence, the FBI has been persona non grata in most conservative circles. Widely despised on the right, the bureau is a boogeyman featured in many <a title=\"https://www.cbsnews.com/news/jan-6-committee-staffer-zero-evidence-that-ray-epps-was-a-federal-agent-60-minutes-2023-04-23/\" href=\"https://www.cbsnews.com/news/jan-6-committee-staffer-zero-evidence-that-ray-epps-was-a-federal-agent-60-minutes-2023-04-23/\">right-wing conspiracy theories</a>, largely designed to explain away Trump’s election defeat and the role of his supporters in the <a title=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/depth-of-field-capitol-mob/\" href=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/depth-of-field-capitol-mob/\">insurrection that followed</a>. Many of the questions that top Republicans put to Wray on Wednesday were seemingly designed to lend credence to these theories. A few members, like Matt Gaetz of Florida, dove deep into InfoWars-like waters.</p><p>One line of questioning was plainly meant to implicate the FBI in helping to <a title=\"https://www.fbi.gov/contact-us/field-offices/washingtondc/news/press-releases/fbi-washington-field-office-releases-video-and-additional-information-regarding-the-pipe-bomb-investigation-090821\" href=\"https://www.fbi.gov/contact-us/field-offices/washingtondc/news/press-releases/fbi-washington-field-office-releases-video-and-additional-information-regarding-the-pipe-bomb-investigation-090821\">plant a bomb</a> outside of a Democratic Party building on the day of the insurrection. Unfortunately, it’s the bureau’s <a title=\"https://www.nytimes.com/2021/04/15/magazine/fbi-international-terrorism-informants.html\" href=\"https://www.nytimes.com/2021/04/15/magazine/fbi-international-terrorism-informants.html\">own</a> <a title=\"https://www.theguardian.com/world/2011/nov/16/fbi-entrapment-fake-terror-plots\" href=\"https://www.theguardian.com/world/2011/nov/16/fbi-entrapment-fake-terror-plots\">troubled</a> <a title=\"https://theintercept.com/2023/06/15/fbi-undercover-isis-teenager-terrorist/\" href=\"https://theintercept.com/2023/06/15/fbi-undercover-isis-teenager-terrorist/\">history</a> that makes it so difficult to defend against such claims.</p><p>It fell mostly on Democrats like Lofgren to point out the irony in labeling an organization known for its <a title=\"https://www.washingtonpost.com/made-by-history/2023/02/23/fbi-conservative-christian-hoover/\" href=\"https://www.washingtonpost.com/made-by-history/2023/02/23/fbi-conservative-christian-hoover/\">Christian conservative leanings</a> of being secretly chock-full of anarchists. Congressman Ken Buck of Colorado noted that Wray’s Wikipedia page lists him as a registered Republican. “I hope,&quot; he said, &quot;you don’t change your party affiliation after this hearing is over.”</p><p>One of the farthest-right members in the House, Gaetz took his turn questioning Wray immediately after Lofgren. His first words were in her defense. “The American people need to understand what just happened,” he railed. “My Democratic colleague just asked the director of the FBI whether or not they are buying information about our fellow Americans, and the answer is, ‘Well, we’ll just have to get back to you.’”</p><p>In an exchange overheard by an Associated Press reporter present for the hearing, Gaetz also heaped praise on another political rival moments after she, too, laid into the director. (“<a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://twitter.com/FarnoushAmiri/status/1679160154854490114\" href=\"https://twitter.com/FarnoushAmiri/status/1679160154854490114\">That was terrific</a>,&quot; he reportedly said.)</p><p>Congresswoman Pramila Jayapal of Washington had dedicated much of her time to drawing attention to <a title=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/odni-commercially-available-information-report/\" href=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/odni-commercially-available-information-report/\">a report declassified last month</a> by Avril Haines, the director of national intelligence and America’s “top spy.” The report states that the purchasing of personal information typically protected under the US constitution—GPS data pulled largely from cell phones, in particular—is a widespread practice throughout the intelligence community (of which, notably, the FBI is a member).</p><p>The report deems the data being actively collected by the US government to be both “sensitive and intimate.” In the wrong hands, a group of former spies turned advisers to Haines wrote, Americans would be vulnerable to serious crimes like harassment, identity theft, and blackmail. Intelligence agencies collect this data, nevertheless, the report states, using a legal theory that paying for it removes any need to obtain a search warrant.</p><p>Privacy experts at digital rights groups, including Demand Progress and the American Civil Liberties Union, consider this practice a legal loophole at odds with the US Constitution&#39;s goal of protecting against unlawful searches and seizures. Many lawmakers, including Jayapal and Lofgren, feel similarly.</p><p>Wray went on to explain that his story had not changed since he <a title=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/fbi-purchase-location-data-wray-senate/\" href=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/fbi-purchase-location-data-wray-senate/\">first disclosed the purchases in March</a> and that the FBI was not actively purchasing location data at this moment. It is unclear what exactly became of the data it did purchase or how it was used, if at all. The FBI has said the data was collected by private companies for advertising purposes and that it was acquired by the government for a vague “pilot project.” An FBI spokesperson did not immediately respond to a request for comment.</p><p>The protection of location and web browsing data were not the only concern raised by lawmakers Wednesday. Republican Thomas Massie would also pepper Wray with questions about another FBI request for “gun purchase records” reportedly issued to a major US bank. The records, Massie claimed, had “no geographical boundaries,” meaning the request was likely not limited to a particular area, city, or state.</p><p>Wray resisted the questions, as he had for most of the hearing. “What I do know,” the director said, “is that a number of business community partners all the time—including financial institutions–share information with us about possible criminal activity.” Massie then asked Wray to clarify whether the bank had volunteered the data or whether the FBI had requested it first.</p><p>Wray declined to respond to the question, saying he could not “speak to specifics.”</p><p>Wray was not entirely opposed to the idea of bettering privacy protections for at least some Americans. Law enforcement officers, he noted, face threats of violence every day as a result of being doxed online. “The more information, personalized information, about law enforcement professionals that is on the internet, the more people who may be unstable or inclined to violence there are out there who can choose to act on it,” he said.</p>"}}, {"slug": "celsius-founder-alex-mashinskys-arrest-wont-fix-crypto", "title": "Celsius Founder Alex Mashinsky’s Arrest Won’t Fix Crypto", "id": "clk3589ft1dl10bsmhgxrgq0l", "createdAt": "14 Jul 2023", "description": "Alex Mashinsky, the former CEO of collapsed crypto lender Celsius, faces seven fraud charges. But while his arrest is cathartic for creditors, the industry is still prone to dangerous hero worship.", "richText": {"html": "<p><strong>ALEX MASHINSKY HAS</strong> been living on borrowed time for months. In January, the founder and former CEO of bankrupt crypto lender Celsius was hit with a <a title=\"https://ag.ny.gov/sites/default/files/mashinsky_complaint.pdf\" href=\"https://ag.ny.gov/sites/default/files/mashinsky_complaint.pdf\">lawsuit</a> by the New York Attorney General, alleging that he’d misled investors. Yesterday, Mashinsky was arrested and <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rUvOaY4GRF9g/v0\" href=\"https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rUvOaY4GRF9g/v0\">charged with seven counts of fraud</a> by the US Department of Justice. If found guilty on all of the criminal counts, Mashinksy could face <a title=\"https://www.justice.gov/usao-sdny/pr/celsius-founder-and-former-chief-revenue-officer-charged-connection-multibillion%5C\" href=\"https://www.justice.gov/usao-sdny/pr/celsius-founder-and-former-chief-revenue-officer-charged-connection-multibillion%5C\">up to 115 years in prison</a>. He pleaded not guilty and was released from custody on a $40 million bond.</p><p>Celsius’ collapse in June 2022 was part of a chain reaction—starting with the fall of the <a title=\"https://www.wired.co.uk/article/terra-luna-collapse\" href=\"https://www.wired.co.uk/article/terra-luna-collapse\">Terra Luna stablecoin</a> in May 2022—that brought crypto to its knees, culminating in November in the bankruptcy of the crypto exchange FTX, whose founder, Sam Bankman-Fried, now faces 13 criminal charges.</p><p>The DOJ accuses Mashinsky of “orchestrating a scheme to defraud customers of Celsius through a series of false claims about the fundamental safety and security of the Celsius platform” and of conspiring with Roni Cohen-Pavon, chief revenue officer at Celsius, to inflate the price of the firm’s own-brand token, CEL. “The message we send today is quite simple: If you rip off ordinary investors to line your own pockets, we will hold you accountable,” said Damian Williams, US Attorney for the Southern District of New York. “Whether it’s old-school fraud or some new-school crypto scheme, it doesn’t matter one bit. It’s all fraud to us.”</p><p>The <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://www.docdroid.net/d4BiIvc/sdny-1-23-cv-06005-1-0-pdf\" href=\"https://www.docdroid.net/d4BiIvc/sdny-1-23-cv-06005-1-0-pdf\">Securities and Exchange Commission</a>, <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://www.courtlistener.com/docket/67604360/1/commodity-futures-trading-commission-v-celsius-network-llc/\" href=\"https://www.courtlistener.com/docket/67604360/1/commodity-futures-trading-commission-v-celsius-network-llc/\">Commodities and Futures Exchange Commission</a>, and <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://www.courtlistener.com/docket/67604364/1/federal-trade-commission-v-celsius-network-inc/\" href=\"https://www.courtlistener.com/docket/67604364/1/federal-trade-commission-v-celsius-network-inc/\">Federal Trade Commission</a> all simultaneously filed separate civil charges in Manhattan federal court on similar grounds. As part of a settlement with the FTC, Celsius has agreed to pay a $4.7 billion fine, but only after creditors have been reimbursed.</p><p>The law firm representing Mashinksy did not respond to a request for comment.</p><p>Mashinsky’s arrest will afford a moment of catharsis to Celsius creditors, whose money remains tied up in bankruptcy proceedings. But some in the industry fear the attitudes that created the conditions for the rapid growth and dramatic collapse of Celsius and FTX are still prevalent and that the industry remains vulnerable to influential individuals who are able to portray themselves as revolutionaries and pioneers.</p><p>“The crypto industry “has an enormous attack vector for intelligent sociopaths,” says Travis Kling, cofounder of hedge fund Ikigai Asset Management. “We haven’t been honest with ourselves about how bad that attack vector is and how damaging it’s been.”</p><p>Founded by Mashinsky in 2017, Celsius took in people’s crypto deposits, which it then invested or loaned out to fund interest payments to account holders and generate returns for itself. Customers were drawn in by promises of interest as high as 17 percent on deposits—tens of times greater than the rate offered by traditional banks at the time. At its peak, the company held custody of upwards of $25 billion in customer assets, the DOJ claims. At the peak of crypto fever in 2021, Celsius’ hours-long “<a title=\"https://www.youtube.com/playlist?list=PLLjzjU2vvKVPgZHwCK3meg4NFYpuwRXt0\" href=\"https://www.youtube.com/playlist?list=PLLjzjU2vvKVPgZHwCK3meg4NFYpuwRXt0\">Ask Mashinsky Anything</a>” livestreams, in which the founder would preach weekly to his congregations of “Celsians,” would attract thousands of people.</p><p>However, the <a title=\"https://www.wired.co.uk/article/terra-luna-collapse\" href=\"https://www.wired.co.uk/article/terra-luna-collapse\">collapse of the Terra Luna stablecoin</a> in May 2022 blew a <a title=\"https://www.cnbc.com/2023/01/05/new-york-ag-accuses-celsius-ex-ceo-of-defrauding-crypto-investors.html\" href=\"https://www.cnbc.com/2023/01/05/new-york-ag-accuses-celsius-ex-ceo-of-defrauding-crypto-investors.html\">billion-dollar hole</a> in the Celsius balance sheet that, combined with a slump in the crypto market, left Celsius unable to meet a surge in customer withdrawals. On June 12, the company announced it would halt withdrawals, citing “extreme market conditions.” A month later, the company filed for Chapter 11 bankruptcy, trapping $4.7 billion of its customers’ money.</p><p>A similar pattern played out at other crypto lenders: BlockFi, Voyager Digital, and Genesis Global Capital have all since filed for bankruptcy, caught up variously in the failures of the Terra Luna stablecoin, hedge fund Three Arrows Capital and crypto exchange <a title=\"https://www.wired.co.uk/article/ftx-collapse-binance-crypto-deal\" href=\"https://www.wired.co.uk/article/ftx-collapse-binance-crypto-deal\">FTX</a>.</p><p>“In the last 18 months, it has become very clear that centralized borrow-lend businesses are a huge problem. They ended up being the epicenter” of the collapse, says Kling—whose fund has substantial assets still locked in the FTX bankruptcy. “There was so much reckless lending.”</p><p>The public nature of the ledger on which crypto sits, says Kyla Curley, a forensic accountant and partner at advisory firm StoneTurn, means Celsius was bound to be caught out eventually. “If the data is telling a story, government agencies will take note and pursue,” she says.</p><p>In the year since Celsius declared bankruptcy, Mashinsky has been accused by creditors of lying about the nature of the service, and by an independent examiner commissioned by the bankruptcy court of operating a Ponzi scheme, whereby payouts to existing customers were funded in effect by others’ deposits.</p><p>In crypto circles, Mashinsky’s arrest was considered “long overdue,” added Cory Klippsten, CEO at trading platform Swan Bitcoin. The DOJ complaint states that, while Mashinsky portrayed Celsius as a “modern day bank,” he instead operated the the company as “a risky investment fund, taking in customer money under false and misleading pretenses and turning customers into unwitting investors in a business far riskier and far less profitable than what Mashinsky had represented.”</p><p>The “litany of charges,” says Lisa Bragança, attorney at Bragança Law and ex-branch chief at the SEC, will be “devastating” for Mashinsky. “It’s a heck of a lot for the government to prove,” she says, “but it only has to prove pieces” to secure a significant jail sentence. It’s also likely that prosecutors have obtained testimony from Celsius insiders, explains Bragança—“and that’s big.”</p><p>At word of Mashinsky’s arrest, a number of Celsius creditors gathered in group channels on Telegram and elsewhere to celebrate: “Fuck yeah,” wrote one creditor. “I’d love to see a perp walk,” said another. But some were more reserved, pointing out that the arrest will do nothing to accelerate asset recoveries. “I wish there was a way to make this madness end sooner,” one channel member wrote.</p><p>Others have been left with an uncomfortable sense that crypto has not yet managed to clear its decks of bad actors and that, should another hype cycle arrive, the conditions that bred the likes of Celsius and FTX could recur. In short, that lessons have not necessarily been learned.</p><p>In particular, says Kling, the crypto industry remains vulnerable to hero worship—a tendency to venerate the individuals that accrue the most money and command the greatest influence in the sector: like Mashinsky, Bankman-Fried, Do Kwon of Terra Luna, and Kyle Davies and Su Zhu of Three Arrows.</p><p>The charges leveled at Celsius and FTX—of deceiving investors, commingling assets, and shuffling customer funds between subsidiaries—are echoed by those brought since March by the CFTC and SEC against Binance, the world’s largest crypto exchange, and its CEO Changpeng Zhao.</p>"}}, {"slug": "why-is-europes-latest-heat-wave-called-cerberus-its-complicated", "title": "Why Is Europe’s Latest Heat Wave Called Cerberus? It’s Complicated", "id": "clk35c9hd1do20bsmhvxeztv9", "createdAt": "14 Jul 2023", "description": "Cerberus, an unofficial name for the current European heat wave, has gone viral—but some meteorologists find it sensationalistic and worry it won't help people take extreme weather seriously.", "richText": {"html": "<p>IF YOU’RE AT all aware of the heat wave baking southern Europe right now, you’ll have heard people referring to it as “Cerberus”—a moniker that invokes the fearsome three-headed dog of Greek mythology. In Dante’s Inferno and the classics that inspired it, Cerberus is a monster associated with the underworld.</p><p><a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://www.dw.com/en/southern-europe-swelters-under-cerberus-heat-wave/a-66221924\" href=\"https://www.dw.com/en/southern-europe-swelters-under-cerberus-heat-wave/a-66221924\">Multiple</a> <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://inews.co.uk/news/cerberus-heatwave-meaning-name-europe-weather-forecast-2474815\" href=\"https://inews.co.uk/news/cerberus-heatwave-meaning-name-europe-weather-forecast-2474815\">reports</a> <a title=\"https://metro.co.uk/2023/07/14/deadly-cerberus-heatwave-sparks-human-health-warning-with-48c-temperatures-set-to-hit-continent-19127464/\" href=\"https://metro.co.uk/2023/07/14/deadly-cerberus-heatwave-sparks-human-health-warning-with-48c-temperatures-set-to-hit-continent-19127464/\">about</a> <a title=\"https://www.bbc.co.uk/news/world-europe-66183069\" href=\"https://www.bbc.co.uk/news/world-europe-66183069\">the</a> blistering heat wave, which has pushed temperatures up to around 40 degrees Celsius (104 degrees Fahrenheit) in Spain, Italy, Greece, and other countries, have cited the Italian Meteorological Society as the institution that chose the name Cerberus for this dangerous weather event.</p><p>But there’s a problem. The society had nothing to do with the heat wave’s dramatic christening. “The name is unofficial, and we absolutely don’t use it,” says Luca Mercalli, the society’s president, adding that he finds it somewhat sensationalistic.</p><p>The name was actually chosen by Italian weather website iLMeteo specifically for the anticyclone, or high-pressure region, currently subjecting southern Europe to extreme heat—a fact confirmed to WIRED by Antonio Sanò, iLMeteo’s founder.</p><p>Sanò shrugs off the accusation that Cerberus could be considered histrionic. “Our names are not official but always become quickly famous, thanks to our popularity,” he says. iLMeteo’s habit of naming anticyclones after mythological figures is the reason the heat wave that struck Europe in 2017 became widely referred to as Lucifer—a name for the planet Venus in Roman folklore that also came to be used for the devil in Christian tradition.</p><p>The confusion over what to call 2023’s European heat wave descends still deeper, like Dante’s many circles of hell, because in the Spanish city of Seville, the heat wave <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://onebillionresilient.org/2023/07/09/heat-wave-xenia-sevilla/\" href=\"https://onebillionresilient.org/2023/07/09/heat-wave-xenia-sevilla/\">has been dubbed Xenia.</a> The Adrienne Arsht-Rockefeller Foundation Resilience Center (Arsht-Rock), in collaboration with the University of Seville and the City of Seville, launched its own heat wave naming system last year. This is the third time the organization has deployed it. The system runs in reverse alphabetical order and uses recognizably Spanish names—but ones that are not overly common, so as to keep them notable.</p><p>And don’t forget that Berliner Wetterkarte (a meteorological nonprofit) and the Free University of Berlin have been naming high- and low-pressure weather events in Europe since 1954. The anticyclone FEE is bringing sunny weather to Germany at the moment, says Petra Gebauer, chair of Berliner Wetterkarte. She explains that groups of meteorologists around Europe sometimes give their own names to heat waves. “Actually, the southeastern group has the name Cleon for the heat wave in Greece,” she explains, adding that she hadn’t known how the name Cerberus emerged.</p><p>The plethora of sobriquets may seem peculiar, but this shouldn’t detract from the danger posed by the present heat in southern Europe. On July 11, a man in his forties collapsed and died in Italy while working outdoors, according to local media, and there have been multiple reports of heatstroke in the country. In Spain, temperatures have hit 45 degrees Celsius in some places, and a new helpline for people affected by heat has received 54,000 calls since it went live last month. Just days ago, scientists published <a title=\"https://www.nature.com/articles/s41591-023-02419-z\" href=\"https://www.nature.com/articles/s41591-023-02419-z\">a study in which they estimated</a> that nearly 62,000 people died in Europe as a result of extreme summer heat last year.</p>"}}, {"slug": "the-hollywood-actors-walkout-will-change-how-we-fight-ai", "title": "The Hollywood Actors' Walkout Will Change How We Fight AI", "id": "clk34ggi61f0f0bu19ud2mwwp", "createdAt": "14 Jul 2023", "description": "Meryl Streep and other outspoken individuals may help artificial intelligence reach a new level of awareness, along with the suspension of production.", "richText": {"html": "<p>When the Matrix co-creator disapproves of your artificial intelligence strategy, you KNOW IT&#39;S terrible. Lilly Wachowski tweeted a series of reasons why she was voting against the Directors Guild of America&#39;s union deal with Hollywood studios in June. The AI provision in the contract, which states that generative AI cannot be regarded as a &quot;person&quot; or carry out tasks typically performed by DGA members, was insufficient. &quot;We need to change the language to imply that we won&#39;t use AI in any department, on any show we work on,&quot; said the speaker. &quot;I firmly believe the struggle we [are] going through in our industry right now is a microcosm of a much more serious and pressing crisis.&quot; </p><p>When the Screen Actors Guild—American Federation of Television and Radio Artists (SAG-AFTRA) went on strike on Thursday, that crisis reached yet another significant turning point. One of the greatest issues involved AI, similar to the Writers Guild of America, which is also on strike. Before the strike, a SAG member told the outlet that actors were starting to view the &quot;Joan Is Awful&quot; episode of Black Mirror as a &quot;documentary of the future&quot; and another said that studios like Warner Bros., Netflix, Disney, Apple, Paramount, and others &quot;can&#39;t pretend we won&#39;t be used digitally or become the source of new, cheap, AI-created content.&quot;</p><p>I wrote about the WGA strike&#39;s similarities to the labor movement of the Luddites a few weeks ago. Similar to the Luddites, authors are concerned about emerging automation taking their work but aren&#39;t outright anti-tech. AI technologies could serve a purpose without endangering anyone&#39;s livelihood if they could be utilized to assist writers—for example, to come up with new names for a sci-fi planet. It would be one thing if big language models could be taught to authors as tools. The WGA contends that this is a problem if they are employed in place of authors or to write scripts that humans must then correct for less money. In the end, they want a say in how AI is applied to the production of movies.</p>"}}, {"slug": "in-the-us-ev-sales-set-a-record-perhaps-now-their-popularity-is-dwindling", "title": "In the US, EV sales set a record. Perhaps now, their popularity is dwindling", "id": "clk34vhto1fii0bu1mflxob7n", "createdAt": "14 Jul 2023", "description": "The photos from the telescope are used in the Apple TV+ adaption of the Isaac Asimov series to create stunning visuals.", "richText": {"html": "<p><strong>THE ORIGINAL POST</strong> <strong>OF THIS STORY CAME FROM THE</strong> nonprofit news source Grist, which focuses on climate justice and solutions.</p><p>Sales of electric vehicles in the United States broke records in the most recent quarter and are expected to surpass 1 million in 2023, which would be a significant achievement for the sector. This increase occurs despite the fact that several car models are no longer eligible for federal and some state incentives.</p><p>Between the beginning of April and the end of June, consumers purchased roughly 300,000 EVs, according to analysts at Wards Intelligence and Cox Automotive. This includes growth in May and June, the first two months following stricter federal tax credit restrictions, and represents an increase of about 50% year over year. Sales of plug-in hybrids increased as well.</p><p>According to Christie Schweinsberg, a sustainability expert at Wards, &quot;There are some vehicles that are intriguing enough to buyers that you don&#39;t need a rebate.&quot; She makes note of the constantly expanding selection of EVs and alternatives available to customers. &quot;People will continue to want to purchase.&quot;</p><p>However, there are indications that the rapid rate of sales growth might not continue. Dealer inventories of internal combustion vehicles had, on average, a 53-day supply at the end of June, according to Cox. On the other hand, the inventory runway for EVs was more than twice as large. In comparison to around 20,000 a year earlier, there were more than 92,000 electric vehicles available overall in the second quarter.</p><p>The demand for electric vehicles is not keeping up with supply, which is the opposite of what was happening a year ago, according to Michelle Krebs, executive analyst at Cox Automotive. &quot;It is referred to as the &#39;Field of Dreams&#39; moment. Although automakers are producing more vehicles, not enough people are buying them.</p><p>Krebs attributes the glut to both a post-pandemic boost in production and traditional consumer hesitations about buying electric vehicles. Price, she says, is the primary barrier among buyers that <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://www.coxautoinc.com/news/as-more-americans-choose-evs-price-and-range-continue-to-hold-back-the-market-according-to-new-cox-automotive-study/\" href=\"https://www.coxautoinc.com/news/as-more-americans-choose-evs-price-and-range-continue-to-hold-back-the-market-according-to-new-cox-automotive-study/\">Cox surveys</a>, because EVs remain generally more expensive than a similar gas-powered model. Concerns about charging infrastructure is another reason would-be-owners stay on the sidelines.</p><p>According to Krebs, the environment for electric vehicle incentives has also grown more complex. Numerous models were eligible for a federal tax credit of up to $7,500 at this time last year, and numerous cities and states also provided additional incentives. Since then, some states have run out of funding for their rebate programs, including Oregon and New Jersey. The manufacturing criteria created by the Inflation Reduction Act, which Congress approved last year, are intended to encourage automakers to invest in US production facilities and battery supply chains. The list of models eligible for a tax credit has been drastically reduced as a result of the law, at least temporarily.</p><p>According to Michael Stewart, a representative for Hyundai, whose vehicles were removed from the government list because they no longer adhere to the new standards, &quot;We certainly see an impact because of it.&quot; Even though all of Hyundai&#39;s EV models saw an increase in sales despite losing the credit, he thinks that without it, the company&#39;s and the nation&#39;s ambitious EV sales targets could have been reached even more quickly.</p><p>However, sales of the Hyundai Kona and the BMW i4, which are also ineligible for federal tax subsidies, nearly tripled. Market leader Tesla reported a 76 percent increase in sales of its well-liked Model Y as a result of recently regaining access to tax subsidies.</p><p>The average cost of an electric vehicle has decreased by about 20%, to $53,438 in the past year alone, as businesses attempt to combat the EV headwinds. The Inflation Reduction Act has a flaw that manufacturers have taken advantage of to claim a credit on automobiles they lease rather than buy. According to Stewart, Hyundai has been particularly aggressive in advertising leases, which have increased from making up about 5 percent of the vehicles the business sells off the lot to nearly 30 percent.</p><p>Following the passage of the Inflation Reduction Act, Hyundai and other businesses declared their intentions to increase the production of electric vehicles in the US and increase domestic sourcing of battery components. One factor, says Schweinsberg, is that there is often a decline in sales within a year or two of a new model being introduced—a threshold some EVs are reaching. “Typically it does well when the new generation comes out,” she said, adding that it’s probably too early to tell exactly what the trajectory for electric vehicles might look like.</p><p>Krebs forecasts that EV sales will increase going forward, albeit &quot;maybe not at the pace that a lot of people had hoped for.&quot; She doesn&#39;t find that particularly unexpected given the significant change the sector is seeking to achieve.</p><p>She claims that this is the largest shift in the sector since Henry Ford introduced his mobile assembly line. &quot;There will be hiccups in the road.&quot;</p>"}}, {"slug": "ok-surfers-how-much-would-it-cost-to-power-your-own-wave", "title": "OK Surfers, How Much Would It Cost to Power Your Own Wave?", "id": "clk48jv2m2as40bu0vzv2puql", "createdAt": "15 Jul 2023", "description": "How much energy would it take to fuel a wave that you can shred like Kelly Slater? Here’s the math.", "richText": {"html": "<p><strong>IF YOU ARE</strong> into surfing, you have a problem: You can only surf where there are waves. Even if you’re lucky enough to live near an ocean, surfable waves aren&#39;t consistent. One day the break is perfect, and the next day the water is flat as glass. Well, there&#39;s a simple solution to this problem: Make your own.</p><p>That&#39;s exactly what happens at places like <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://kswaveco.com/surf-ranch/\" href=\"https://kswaveco.com/surf-ranch/\">Surf Ranch</a>, which has <a title=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/kelly-slaters-artificial-surf-pool-is-really-making-waves/\" href=\"https://12ft.io/proxy?ref=&q=https://www.wired.com/story/kelly-slaters-artificial-surf-pool-is-really-making-waves/\">created a barreling wave</a> that travels 2,300 feet. Making an artificial wave machine starts with a body of water. In this case, it&#39;s basically a rectangular pond. On one of the long sides is a type of car on rails with a hydrofoil, essentially a wing that runs through the water. <a rel=\"nofollow noopener\" class=\"external-link\" target='_blank' title=\"https://kswaveco.com/the-technology/\" href=\"https://kswaveco.com/the-technology/\">As the hydrofoil moves, it creates surfable waves</a>. Also, by adjusting the hydrofoil, the waves can be custom-made (to a degree) to produce waves between <a title=\"https://youtu.be/AXtVnLe2SUc\" href=\"https://youtu.be/AXtVnLe2SUc\">6 and 8 feet high with speeds between 10 and 20 miles per hour</a>.</p><p>But let’s say you don&#39;t live close to any surf parks, and you decide to build your own. Let’s not sweat the technical details. We’ll just assume you already have a small lake and can build a track next to it that pushes your giant electric-motor-powered hydrofoil. Instead, let’s get to the real question: How much is a single wave going to cost you?</p><p>When you pay your electricity bill every month, you are paying for energy in the form of electrical current. Electricity prices vary by location, but we can estimate the amount of energy needed to create one fake wave and then use average prices to find out how much that would cost.</p><p>Imagine a very simple wave. If you looked at it from the side, it might take a shape like this:</p><p><a title=\"https://media.wired.com/photos/64b08fa7daed59ebbf460c84/master/w_1600,c_limit/rhett_surfwave-(1).jpg\" href=\"https://media.wired.com/photos/64b08fa7daed59ebbf460c84/master/w_1600,c_limit/rhett_surfwave-(1).jpg\">https://media.wired.com/photos/64b08fa7daed59ebbf460c84/master/w_1600,c_limit/rhett_surfwave-(1).jpg</a></p><p>ILLUSTRATION: RHETT ALLAIN</p><p>Yes, we don&#39;t yet know the mass of the wave—but just hold on.</p><p>The other type of energy the wave has is gravitational potential energy. This is associated with the gravitational interaction between the water and the Earth. As an object moves away from the surface of the Earth, it has an increase in gravitational potential energy. Since this wave sticks out above the surface of the water, it&#39;s going to have some potential. We almost always use <strong>U</strong> to represent potential energy, and we can calculate it like this:</p><p><br></p>"}}, {"slug": "the-actual-effects-of-internet-outages", "title": "The Actual Effects of Internet Outages", "id": "clk9y3hm11u4d0bu149l283ud", "createdAt": "19 Jul 2023", "description": "The  NetLoss calculator is a new tool that estimates the economic cost of Internet shutdowns", "richText": {"html": "<p>People in Algeria may have felt as though they had woken up in a different age earlier this month as they tried to go about their everyday online lives. Large portions of the Internet were inaccessible to everyone as a result of the government ordering Internet Service Providers (ISPs) to block specific websites, including news and social networking services.</p><p>Local authorities issued the directives as part of their attempts to prevent cheating during the 11–15 June national baccalaureate exams.</p><h4>Economic Impact on Local Citizens</h4><p>Journalist and editor-in-chief of Desert Foot Mehdi Dahhak said to Internet Society partner Social Media Exchange (SMEX) that &quot;this reality disrupts our work significantly, especially since most of our readers are Facebook and Twitter users, which leads to a decrease in readability rates and this affects us economically.&quot;</p><p>Tourism businesses are among the worst affected by the loss of Internet connection, according to Sarah Zahaf, manager of an Algiers travel agency. Our agency &quot;suffered material losses estimated at 10% per day due to [missing] ticket reservation [deadlines], in addition to our inability to meet the demands of customers upon arrival due to the interruption of the network [due to the Internet disruptions]&quot;</p><p>Measuring the economic impact of Internet shutdowns like the ones that happened in Algeria, as well as the other <a title=\"https://pulse.internetsociety.org/shutdowns\" href=\"https://pulse.internetsociety.org/shutdowns\">18 shutdowns that Internet Society Pulse has tracked</a> in the month of June alone, has been a challenge outside of these personal accounts. Until now.</p><h4>Introducing the NetLoss Calculator</h4><p>The  NetLoss calculator is a new tool that estimates the economic cost of Internet shutdowns by way of a rigorous methodology.</p><p>The NetLoss calculator uses a reproducible, econometric framework to consider a wide range of publicly available economic inputs including:</p><ul><li><div><strong>Shutdown data</strong>: Government-mandated shutdown occurrences are given extensive event-level data by Internet Society Pulse, which has classified shutdowns since 2019 as either national, regional, or service blocking.</div></li><li><div><strong>Protests and civil unrest</strong>: Since 2016, several incidents have been covered in-depth event-level data by the Armed Conflict Location &amp; Event Data Project. Each event is divided into one of five categories: battles, protests, riots, strategic advancements, or violence against civilians (categories a through e). Additionally, it records the beginning and ending times of these incidents, lists the persons engaged, and notes whether any fatalities were related to the incident.</div></li><li><div><strong>Elections</strong>: Since 1960, statistics from elections for lower chambers in more than 150 nations have been made available at the month-year level by the Yale University-maintained Constituency-Level Elections Archive.</div></li><li><div><strong>Socioeconomic indicators</strong>: The World Bank provides information on economic statistics, including GDP expressed in US dollars at current exchange rates, estimates of employment from the International Labor Organization (ILO), and figures for net inflows and outflows of FDI.</div></li></ul><p>The NetLoss calculator also takes into account additional variables that may have an effect on country-specific economic outcomes, such as the rate of inflation (percentage), age dependency ratio (percentage of working people ages 18 to 65 to the total population), the proportion of the population that lives in urban areas, and the proportion of the labor force that has a basic education.</p>"}}]